

class script(object):
    START_TXT = """ʜᴇʟʟᴏ {} ✨

ᴍʏ ɴᴀᴍᴇ ɪs {} ♻️ 

ɪ ᴀᴍ ᴀɴ ᴀᴅᴠᴀɴᴄᴇᴅ ᴀɴᴅ ᴘᴏᴡᴇʀғᴜʟ ғɪʟᴇ sᴛᴏʀᴀɢᴇ ʙᴏᴛ ᴡɪᴛʜ:

✦ ᴄʟᴏɴᴇ ғᴇᴀᴛᴜʀᴇ
✦ ᴀᴜᴛᴏᴍᴀᴛɪᴄ ᴅᴇʟᴇᴛᴇ sᴜᴘᴘᴏʀᴛ
✦ ᴘʀᴇᴍɪᴜᴍ ᴜɪ ᴀɴᴅ ᴘᴇʀғᴏʀᴍᴀɴᴄᴇ
✦ ᴀᴅᴠᴀɴᴄᴇᴅ ғɪʟᴇ ᴍᴀɴᴀɢᴇᴍᴇɴᴛ

ʟᴇᴛ's sᴛᴀʀᴛ ✨"""



    
    CAPTION = """📂 ғɪʟᴇɴᴀᴍᴇ : {file_name}

⚙️ sɪᴢᴇ : {file_size}

Jᴏɪɴ [ᴜᴘᴅᴀᴛᴇ ᴄʜᴀɴɴᴇʟ](https://t.me/premium)""" 




    CLONE_START_TXT = """ʜᴇʟʟᴏ {}, ᴍʏ ɴᴀᴍᴇ {} 👋, ɪ ᴀᴍ ʟᴀᴛᴇꜱᴛ ᴀᴅᴠᴀɴᴄᴇᴅ ᴀɴᴅ ᴘᴏᴡᴇʀꜰᴜʟ ꜰɪʟᴇ ꜱᴛᴏʀᴇ ʙᴏᴛ ᴡɪᴛʜ ᴀᴜᴛᴏ ᴅᴇʟᴇᴛᴇ sᴜᴘᴘᴏʀᴛ ᴀɴᴅ ʙᴇꜱᴛ ᴜɪ ᴘᴇʀꜰᴏʀᴍᴀɴᴄᴇ

ɪғ ʏᴏᴜ ᴡᴀɴᴛ ᴛʜɪs ғᴇᴀᴛᴜʀᴇ ᴛʜᴇɴ ᴄʀᴇᴀᴛᴇ ʏᴏᴜʀ ᴏᴡɴ ᴄʟᴏɴᴇ ʙᴏᴛ ғʀᴏᴍ ᴍʏ <a href=https://t.me/premium>ᴘᴀʀᴇɴᴛ</a>"""


    ABOUT_TXT = """ʜɪ ɪ ᴀᴍ ᴘᴇʀᴍᴀɴᴇɴᴛ ғɪʟᴇ sᴛᴏʀᴇ ʙᴏᴛ ᴡɪᴛʜ ᴄʟᴏɴᴇ ғᴇᴀᴛᴜʀᴇ + ᴀᴜᴛᴏ ᴅᴇʟᴇᴛᴇ.

📝 ʟᴀɴɢᴜᴀɢᴇ: <a href=https://www.python.org>𝐏𝐲𝐭𝐡𝐨𝐧𝟑</a>

📚 ʟɪʙʀᴀʀʏ: <a href=https://docs.pyrogram.org>𝐏𝐲𝐫𝐨𝐠𝐫𝐚𝐦</a>

✨ ᴍɪɴɪᴍᴀʟ & ᴇғғɪᴄɪᴇɴᴛ ғɪʟᴇ sᴛᴏʀᴀɢᴇ sᴏʟᴜᴛɪᴏɴ"""

    CABOUT_TXT = """ʜɪ ɪ ᴀᴍ ᴘᴇʀᴍᴀɴᴇɴᴛ ғɪʟᴇ sᴛᴏʀᴇ ʙᴏᴛ ᴡɪᴛʜ ᴄʟᴏɴᴇ ғᴇᴀᴛᴜʀᴇ + ᴀᴜᴛᴏ ᴅᴇʟᴇᴛᴇ.

📝 ʟᴀɴɢᴜᴀɢᴇ: <a href=https://www.python.org>𝐏𝐲𝐭𝐡𝐨𝐧𝟑</a>

📚 ʟɪʙʀᴀʀʏ: <a href=https://docs.pyrogram.org>𝐏𝐲𝐫𝐨𝐠𝐫𝐚𝐦</a>

✨ ᴍɪɴɪᴍᴀʟ & ᴇғғɪᴄɪᴇɴᴛ ғɪʟᴇ sᴛᴏʀᴀɢᴇ sᴏʟᴜᴛɪᴏɴ"""

    CAPTION_MENU_TXT = """📝 ᴄᴀᴘᴛɪᴏɴ ᴄᴏᴍᴍᴀɴᴅs

🔻 /addcaption - sᴇᴛ ᴀ ᴄᴜsᴛᴏᴍ ᴄᴀᴘᴛɪᴏɴ ᴛᴇᴍᴘʟᴀᴛᴇ

ᴇxᴀᴍᴘʟᴇ:
<code>/addcaption {filename}
💾 Size: {filesize}
Krishna💗</code>

🔻 /view_caption - ᴠɪᴇᴡ ʏᴏᴜʀ ᴄᴜʀʀᴇɴᴛ ᴄᴀᴘᴛɪᴏɴ
   ᴇxᴀᴍᴘʟᴇ: /view_caption

🔻 /del_caption - ʀᴇᴍᴏᴠᴇ ᴛʜᴇ ᴄᴀᴘᴛɪᴏɴ
   ᴇxᴀᴍᴘʟᴇ: /del_caption

ᴛᴇᴍᴘʟᴀᴛᴇ ᴠᴀʀɪᴀʙʟᴇs:
{ғɪʟᴇɴᴀᴍᴇ} - ғɪʟᴇ ɴᴀᴍᴇ
{ғɪʟᴇsɪᴢᴇ} - ғɪʟᴇ sɪᴢᴇ
{ᴅᴜʀᴀᴛɪᴏɴ} - ᴠɪᴅᴇᴏ ᴅᴜʀᴀᴛɪᴏɴ"""


    CLONE_TXT = """ʜᴇʟʟᴏ {} 👋

ғɪʀsᴛ sᴇɴᴅ /clone ᴄᴏᴍᴍᴀɴᴅ ᴛʜᴇɴ ғᴏʟʟᴏᴡ ʙᴇʟᴏᴡ sᴛᴇᴘs:
    
1️⃣ sᴇɴᴅ <code>/newbot</code> ᴛᴏ @BotFather
2️⃣ ɢɪᴠᴇ ᴀ ɴᴀᴍᴇ ғᴏʀ ʏᴏᴜʀ ʙᴏᴛ
3️⃣ ɢɪᴠᴇ ᴀ ᴜɴɪǫᴜᴇ ᴜsᴇʀɴᴀᴍᴇ
4️⃣ ᴛʜᴇɴ ʏᴏᴜ ᴡɪʟʟ ɢᴇᴛ ᴀ ᴍᴇssᴀɢᴇ ᴡɪᴛʜ ʏᴏᴜʀ ʙᴏᴛ ᴛᴏᴋᴇɴ
5️⃣ ғᴏʀᴡᴀʀᴅ ᴛʜᴀᴛ ᴍᴇssᴀɢᴇ ᴛᴏ ᴍᴇ

ᴛʜᴇɴ ɪ ᴡɪʟʟ ᴄʀᴇᴀᴛᴇ ᴀ ᴄʟᴏɴᴇ ʙᴏᴛ ғᴏʀ ʏᴏᴜ ✨"""


    HELP_TXT = """💢 ʜᴏᴡ ᴛᴏ ᴜsᴇ ᴛʜᴇ ʙᴏᴛ ☺️

━━━━━━━━━━━━━━━━━━━━━

🔻 /link - ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴠɪᴅᴇᴏ ᴏʀ ғɪʟᴇ ᴛᴏ ɢᴇᴛ ᴀ sʜᴀʀᴀʙʟᴇ ʟɪɴᴋ

🔻 /batch - sᴇɴᴅ ᴛʜᴇ ғɪʀsᴛ ᴀɴᴅ ʟᴀsᴛ ᴘᴏsᴛ ʟɪɴᴋs ғʀᴏᴍ ʏᴏᴜʀ ғɪʟᴇ sᴛᴏʀᴇ ᴄʜᴀɴɴᴇʟ
   ᴇx - <code>/batch https://t.me/premium/25 https://t.me/premium/30</code>

🔻 /clone - ᴄʀᴇᴀᴛᴇ ʏᴏᴜʀ ᴏᴡɴ ɪᴅᴇɴᴛɪᴄᴀʟ ᴄʟᴏɴᴇ ʙᴏᴛ

🔻 /settings - ᴄᴜsᴛᴏᴍɪᴢᴇ ʏᴏᴜʀ ʙᴏᴛ sᴇᴛᴛɪɴɢs

🔻 /deletecloned - ᴅᴇʟᴇᴛᴇ ʏᴏᴜʀ ᴄʟᴏɴᴇ ʙᴏᴛ

🔻 /broadcast - ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴍᴇssᴀɢᴇ ᴛᴏ ʙʀᴏᴀᴅᴄᴀsᴛ (ʙᴏᴛ ᴏᴡɴᴇʀ ᴏɴʟʏ)

━━━━━━━━━━━━━━━━━━━━━

✨ ᴇɴᴊᴏʏ ✨"""



    CHELP_TXT = """💢 ʜᴏᴡ ᴛᴏ ᴜsᴇ ᴛʜɪs ʙᴏᴛ ☺️

━━━━━━━━━━━━━━━━━━━━━

🔻 /link - ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴠɪᴅᴇᴏ ᴏʀ ғɪʟᴇ ᴛᴏ ɢᴇᴛ ᴀ sʜᴀʀᴀʙʟᴇ ʟɪɴᴋ

🔻 /broadcast - ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴍᴇssᴀɢᴇ ᴛᴏ ʙʀᴏᴀᴅᴄᴀsᴛ (ʙᴏᴛ ᴏᴡɴᴇʀ ᴏɴʟʏ)

━━━━━━━━━━━━━━━━━━━━━

✨ ᴇɴᴊᴏʏ ✨"""


    LOG_TEXT = """#NewUser
    
ID - <code>{}</code>

Nᴀᴍᴇ - {}
"""
    RESTART_TXT = """
Bᴏᴛ Rᴇsᴛᴀʀᴛᴇᴅ ✨

📅 Dᴀᴛᴇ : <code>{}</code>
⏰ Tɪᴍᴇ : <code>{}</code>
🌐 Tɪᴍᴇᴢᴏɴᴇ : <code>Asia/Kolkata</code>
🛠️ Bᴜɪʟᴅ Sᴛᴀᴛᴜs: <code>v2.7.1 [ Sᴛᴀʙʟᴇ ]</code>"""

